Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The use of the word "base" in base.Method() has been replaced with super (super.Method()) to distinguish the two concepts better:
ja: base.Method()の「base」という言葉の使用は、2つの概念をよりよく区別するために、super（super.Method()）に置き換えられています：

source: The user can change it by backspacing or other means.
ja: ユーザーがバックスペースなどで変更することが可能です。

source: The user can double-click a file, or right-click one or more files to display a context menu.
ja: ユーザーは、ファイルをダブルクリックするか、1つまたは複数のファイルを右クリックしてコンテキストメニューを表示することができます。

source: The user can press an OK button to close the message box and continue execution.
ja: ユーザーはOKボタンを押すことでメッセージボックスを閉じ、実行を継続することができます。

source: The user can resize the dialog window by dragging its borders.
ja: ユーザーは、ダイアログウィンドウの境界線をドラッグすることで、ダイアログウィンドウのサイズを変更することができます。

source: The user can scroll to see more tabs, if necessary.
ja: 必要であれば、ユーザーはスクロールしてより多くのタブを見ることができる。

source: The user cannot drag the window frame to a size larger than these dimensions.
ja: ユーザーはウィンドウ・フレームをドラッグしてこれらの寸法より大きなサイズにすることはできない。

source: The user cannot drag the window frame to a size smaller than these dimensions.
ja: ユーザーはウィンドウ・フレームをドラッグしてこれらの寸法より小さいサイズにすることはできない。

source: The user clicks on the tooltip (this behavior may vary depending on operating system version).
ja: ユーザーがツールチップをクリックする（この動作は、オペレーティングシステムのバージョンによって異なる場合があります）。

source: The user clicks the buttons to expand or collapse a parent item's list of child items.
ja: ユーザーがボタンをクリックすると、親アイテムの子アイテムのリストを展開または折りたたむことができます。

source: The user interface does not respond to user input while the script is running.
ja: スクリプトの実行中は、ユーザーインターフェースはユーザー入力に反応しません。

source: The user is logging off.
ja: ユーザーがログオフしている。

source: The user is prevented from interacting with the computer (mouse and keyboard input has no effect).
ja: ユーザーがコンピューターと対話することができない（マウスやキーボードの入力が効果を発揮しない）状態です。

source: The user may either click the checkbox or press the spacebar to check or uncheck a row.
ja: ユーザーは、チェックボックスをクリックするか、スペースバーを押して、行のチェックを入れたり外したりすることができます。

source: The user may either click the checkbox or press the spacebar to check or uncheck an item.
ja: ユーザーは、チェックボックスをクリックするか、スペースバーを押して、項目のチェックを入れたり外したりすることができます。

source: The user presses Esc while the GUI window is active.
ja: GUIウィンドウがアクティブな状態で、ユーザーがEscを押した場合。

source: The user right-clicks the control or presses Menu or Shift+F10 while the control has the keyboard focus.
ja: コントロールにキーボードフォーカスがある状態で、ユーザーがコントロールを右クリックするか、MenuまたはShift+F10を押した場合。

source: The user right-clicks within the window or presses Menu or Shift+F10.
ja: ユーザーはウィンドウ内で右クリックするか、MenuまたはShift+F10を押してください。

source: The user selected Exit from the main window's menu or from the standard tray menu.
ja: ユーザーは、メインウィンドウのメニューまたは標準トレイメニューからExitを選択しました。

source: The user's keyboard and mouse input is ignored while a Click, MouseMove, MouseClick, or MouseClickDrag is in progress (the traditional SendEvent mode only).
ja: Click、MouseMove、MouseClick、または、MouseClickDragの実行中は、ユーザーのキーボードやマウスの入力は無視されます（従来のSendEventモードの場合のみ）。

source: The user's keyboard and mouse input is ignored while a SendEvent is in progress (including Send and SendText if SendMode "Event" has been used).
ja: SendEvent（SendMode "Event"が使用されている場合はSendと SendTextを含む）の実行中は、ユーザーのキーボードとマウス入力は無視されます。

source: The v2 installer does not provide an option to separate taskbar buttons.
ja: v2インストーラーには、タスクバーボタンを分離するオプションがありません。

source: The v2 installer works differently and has not been finalized.
ja: v2インストーラーの動作は異なっており、最終決定ではありません。

source: The value (if there is no value, Value becomes uninitialized).
ja: 値（値がない場合、Valueは 未初期化される）。

source: The value being assigned.
ja: 割り当てられている値。

source: The value can be -1 so that it never times out (modifier keys are always pushed back down after the Send), or 0 so that it always times out (modifier keys are never pushed back down).
ja: 値は、タイムアウトしないように-1（修飾キーは常に送信後に押し戻される）、または常にタイムアウトするように0（修飾キーは決して押し戻されない）を指定することができます。

source: The value is never stored in a variable automatically, but is accessible via GuiControl.Value.
ja: 値が自動的に変数に格納されることはなく、GuiControl.Valueでアクセスすることができます。

source: The value is never stored in a variable automatically, but is accessible via GuiCtrl.Value.
ja: 値が自動的に変数に格納されることはなく、GuiCtrl.Valueでアクセスすることができます。

source: The value is not zero-padded, e.g. 9 is retrieved, not 009.
ja: 例えば、009ではなく9が取り出される。

source: The value of SetKeyDelay determines the speed at which keys are sent.
ja: SetKeyDelayの値によって、キーが送信される速度が決まります。

source: The value of pi (approximately 3.141592653589793) is 4 times the arctangent of 1.
ja: πの値（約3.141592653589793）は、1のアークタンジェントの4倍です。

source: The value to be used.
ja: 使用する値。

source: The value to be written.
ja: 書き込むべき値。

source: The value to check.
ja: チェックする値です。

source: The value to return if the specified key or value does not exist.
ja: 指定されたキーまたは値が存在しない場合に返す値。

source: The value to return on failure, such as if the requested key, section or file is not found.
ja: 要求されたキー、セクション、またはファイルが見つからない場合など、失敗したときに返す値。

source: The value to set the property to.
ja: プロパティを設定する値。

source: The value to wrap.
ja: ラップする値。

source: The values and subkeys are retrieved in reverse order (bottom to top) so that RegDelete and RegDeleteKey can be used inside the loop without disrupting the loop.
ja: 値とサブキーは逆順（下から上）に取得されるため、ループを中断させることなく、RegDeleteと RegDeleteKeyをループ内で使用することができます。

source: The values for XX and YYY are hexadecimal and can usually be determined from the main window's View->Key history menu item.
ja: XXとYYYの値は16進数で、通常はメインウィンドウ「View->Key history」メニュー項目から判断することができます。

source: The values in the names must first be set by the expression or command.
ja: nameの値は、まず式やコマンドによって設定されなければならない。

source: The values returned for a minimized window may vary depending on OS and configuration, but are usually -32000 for the X and Y coordinates and zero for the width and height.
ja: 最小化されたウィンドウに対して返される値は、OSや設定によって異なるかもしれないが、通常、XとY座標は-32000、幅と高さは0である。

source: The values returned in this case may vary depending on OS and configuration, but are usually -32000 for the X and Y coordinates and zero for the width and height.
ja: この場合に返す値はOSや設定によりますが、通常はXとY座標が-32000、幅と高さが0です。

source: The values returned in this case may vary depending on OS and configuration.
ja: この場合に返される値は、OSや設定によって異なる場合があります。

source: The variable A_Args contains the incoming parameters.
ja: 変数A_Argsには、入力されるパラメータが格納される。

source: The variable corresponding to the closure itself (such as activate) is also a non-static local variable, so any nested functions which refer to a closure are automatically closures.
ja: クロージャそのものに対応する変数（activateなど）も非静的なローカル変数なので、クロージャを参照するネストした関数は自動的にクロージャになります。

source: The variable is typically an optional parameter, but can be any variable.
ja: 変数は通常オプションのパラメータだが、どんな変数でも構わない。

source: The variable itself.
ja: 変数そのものです。

source: The variable may be passed conditionally via the ternary operator or on the right-hand side of AND/OR.
ja: 変数は、三項演算子や AND/ORの右辺で条件付きで渡すことができる。

source: The variable will be made blank if the PID could not be determined, which usually happens if a system verb, document, or shortcut is launched rather than a direct executable file.
ja: PIDを決定できなかった場合、この変数は空白になります。これは通常、直接の実行ファイルではなく、システムの動詞、文書、ショートカットが起動された場合に起こります。

source: The variable's name.
ja: 変数の名前です。

source: The variable's value.
ja: 変数の値です。

source: The variables below are built into the program and can be referenced by any script.
ja: 以下の変数はプログラムに組み込まれており、どのスクリプトからも参照できる。

source: The variables in which to store the values returned by the enumerator at the beginning of each iteration.
ja: 各反復の最初に列挙者が返す値を格納するための変数です。

source: The version number of the operating system, in the format "major.minor.build".
ja: オペレーティングシステムのバージョン番号。「major.minor.build」の形式。

source: The version number.
ja: バージョン番号。

source: The vertical bar separates two or more alternatives.
ja: 縦棒は2つ以上の選択肢を区切る。

source: The view can also be changed after the control is created; for example:
ja: また、ビューはコントロール作成後に変更することも可能です：

source: The view can also be changed after the control is created; for example: LV.Opt("+IconSmall").
ja: また、ビューはコントロール作成後に変更することも可能です：LV.Opt("+IconSmall")。

source: The virtual key (VK) of the wheel events (WheelDown, WheelUp, WheelLeft, and WheelRight) are placeholder values that do not have any meaning outside of AutoHotkey.
ja: ホイールイベント（WheelDown、WheelUp、WheelLeft、WheelRight）の仮想キー（VK）は、AutoHotkeyの外では意味を持たないプレースホルダー値です。

source: The virtual screen is the bounding rectangle of all display monitors.
ja: 仮想スクリーンは、すべてのディスプレイ・モニターの外接矩形である。

source: The wheel will still function normally whenever the Alt-Tab menu isn't visible.
ja: Alt-Tabメニューが表示されていない場合でも、ホイールは正常に機能します。

source: The width and height of the dialog's client area, which excludes the title bar and borders.
ja: タイトルバーと境界線を除いたダイアログのクライアント領域の幅と高さです。

source: The width and height of the primary monitor, in pixels (e.g. 1024 and 768).
ja: プライマリ・モニターの幅と高さをピクセル単位で指定する（例：1024と768）。

source: The width and height options now set the size of the client area (the area excluding the title bar and window frame), so are less theme-dependent.
ja: 幅と高さのオプションは、クライアント領域（タイトルバーとウィンドウフレームを除く領域）のサイズを設定するようになり、テーマへの依存度が低くなりました。

source: The width and height to load the image at, where n is an integer.
ja: 画像を読み込む幅と高さを指定します。nは整数です。

source: The width is " w ".
ja: 幅は" w ".

source: The width of each tab is increased, if necessary, so that each row of tabs fills the entire width of the tab control.
ja: 各タブの幅は必要に応じて拡大され、タブの各行がタブコントロールの幅全体を埋めるようになる。

source: The window does not have to be active to be detected.
ja: ウィンドウがアクティブでなくても検出されます。

source: The window handle (HWND) of a GUI control, or a child window of such a control (e.g. the Edit control of a ComboBox).
ja: GUIコントロールのウィンドウハンドル（HWND）、またはその子ウィンドウ（例：ComboBoxのEditコントロール）です。

source: The window handle (HWND) of a GUI window previously created by the script, or if RecurseParent is true, any child window of a GUI window created by the script.
ja: スクリプトによって以前に作成されたGUIウィンドウのウィンドウハンドル（HWND）、またはRecurseParentがtrueの場合、スクリプトによって作成されたGUIウィンドウの子ウィンドウを指定します。

source: The window has no transparency color.
ja: ウィンドウには透明色がありません。

source: The window has no transparency level.
ja: ウィンドウに透明度の設定がありません。

source: The window is also destroyed when the object is deleted, but the object is "kept alive" while the window is visible.
ja: オブジェクトが削除されるとウィンドウも破壊されますが、ウィンドウが表示されている間はオブジェクトが「生かされる」のです。

source: The window is also shown and activated, if necessary.
ja: また、必要に応じてウィンドウを表示し、起動します。

source: The window is also shown without activating it.
ja: また、ウィンドウをアクティブにしなくても表示されます。

source: The window is closed.
ja: 窓が閉まっています。

source: The window is maximized (WinRestore can unmaximize it).
ja: ウィンドウが最大化されています（WinRestoreは最大化を解除できます）。

source: The window is minimized (WinRestore can unminimize it).
ja: ウィンドウが最小化されています（WinRestoreは最小化を解除できます）。

source: The window is neither minimized nor maximized.
ja: ウィンドウは最小化も最大化もされていません。

source: The window is resized, minimized, maximized or restored.
ja: ウィンドウのサイズ変更、最小化、最大化、復元を行います。

source: The window is restored even if it was already active.
ja: ウィンドウがすでにアクティブであったとしても、復元される。

source: The window normally opens on ListLines view by default.
ja: デフォルトでは、通常ListLinesビューでウィンドウが開きます。

source: The window title must always come first.
ja: ウィンドウのタイトルは必ず最初に表示される必要があります。

source: The window title.
ja: ウィンドウのタイトルです。

source: The window under the mouse cursor does not have to be active for a control to be detected.
ja: マウスカーソルがあるウィンドウがアクティブでなくても、コントロールは検出されます。

source: The word "Blind" may be followed by one or more modifier symbols (!#^+) to allow those modifiers to be released automatically if needed.
ja: 「Blind」の後に1つ以上の修飾記号(!#^+)を付けると、必要に応じてそれらの修飾記号が自動的に解除されるようになる場合があります。

source: The word "This" was removed from "Reload This Script" and "Edit This Script", for consistency with "Pause Script" and the main window's menu options.
ja: 「スクリプトの一時停止」やメインウィンドウのメニューオプションとの整合性をとるため、「このスクリプトを再読み込み」「このスクリプトを編集」から「この」という単語を削除しました。

source: The word "Off" (case-insensitive) may be specified to completely turn off transparency for a window.
ja: "Off"（大文字と小文字を区別しない）を指定すると、ウィンドウの透明度を完全にオフにすることができる。

source: The word Cdecl is normally omitted because most functions use the standard calling convention rather than the "C" calling convention (functions such as wsprintf that accept a varying number of arguments are one exception to this).
ja: ほとんどの関数は「C」呼び出し規約ではなく、標準呼び出し規約を使用しているため、Cdeclという言葉は通常省略されます（wsprintfのように様々な数の引数を受け付ける関数は例外です）。

source: The word Play applies the above settings to the SendPlay mode rather than the traditional SendEvent mode.
ja: Playという単語は、上記の設定を従来のSendEventモードではなく、SendPlayモードに適用します。

source: The word Play applies the delay to the SendPlay mode rather than the traditional Send/SendEvent mode.
ja: Playという単語は、従来のSend/SendEventモードではなく、SendPlayモードにディレイを適用します。

source: The word Bold may optionally be followed immediately by a 0 or 1 to indicate the starting state.
ja: Boldの直後に、開始状態を示す0または1を続けることもできる。

source: The word Check may optionally be followed immediately by a 0 or 1 to indicate the starting state.
ja: Checkの直後に、開始状態を示す0または1を続けることもできる。

source: The word Select may optionally be followed immediately by a 0 or 1 to indicate the starting state.
ja: Selectの後に、オプションとして、開始状態を示す0または1が続く場合がある。

source: The word Hidden may optionally be followed immediately by a 0 or 1 to indicate the starting state (0 for visible and 1 for hidden).
ja: Hiddenの直後に0または1を付加して、開始時の状態を示すこともできる（0は可視、1は非表示）。

source: The word NOT is synonymous with ! except that ! has a higher precedence.
ja: "NOT"は!と同義だが、!の方が優先順位が高い。

source: The word UP may follow the name of a hotkey to cause the hotkey to fire upon release of the key rather than when the key is pressed down.
ja: ホットキーの名前の後にUPという単語を付けると、キーを押したときではなく、キーを離したときにホットキーが起動するようにすることができます。

source: The words true and false are built-in variables containing 1 and 0.
ja: trueと falseという言葉は、1と0を含む組み込み変数です。

source: The words listed above are permitted as property or window group names.
ja: 上記の単語は、プロパティ名やウィンドウグループ名として許可されています。

source: The working area of a monitor excludes the area occupied by the taskbar and other registered desktop toolbars.
ja: モニターの作業領域は、タスクバーや登録されたデスクトップのツールバーが占める領域を除きます。

source: The working directory defaults to A_ScriptDir.
ja: 作業ディレクトリは、デフォルトでA_ScriptDirとなります。

source: The working directory for the launched item.
ja: 起動したアイテムの作業ディレクトリです。

source: The wrapped value (an object) can be passed directly to ComCall.
ja: ラップされた値（オブジェクト）は、直接ComCallに渡すことができる。

source: The wrapper object assumes responsibility for automatically releasing the pointer when appropriate.
ja: ラッパーオブジェクトは、適切な場合に自動的にポインタを解放する責任を負います。

source: The x/y coordinates of the drag's starting position (the mouse will be moved to these coordinates right before the drag is started).
ja: ドラッグ開始位置のx/y座標（マウスはドラッグ開始直前にこの座標に移動します）。

source: The x/y coordinates to drag the mouse to (that is, while the button is held down).
ja: マウスをドラッグする先のx/y座標（つまり、ボタンを押したままの状態）。

source: The x/y coordinates to move the mouse to.
ja: マウスの移動先となるx/y座標です。

source: The x/y coordinates to which the mouse cursor is moved prior to clicking.
ja: クリックする前にマウスカーソルを移動させるx/y座標を指定します。

source: The zero following the asterisk may be replaced by any valid dwFlags number; for details, search www.microsoft.com for InternetOpenUrl.
ja: アスタリスクに続くゼロは、有効なdwFlags番号で置き換えることができます。詳細は、www.microsoft.com「InternetOpenUrl」を検索してください。

source: The zero-based index of the method within the virtual function table.
ja: 仮想関数テーブル内のメソッドのゼロベースインデックス。

source: Their specification is similar to WinTitle and WinText, except that ExcludeTitle does not recognize any criteria other than the window title.
ja: 指定の仕方はWinTitleとWinTextに似ていますが、ExcludeTitleはウィンドウのタイトル以外の基準（ウィンドウクラスやHWNDなど）を認識しません。

source: Their text is thus considered "hidden".
ja: そのため、そのテキストは「非表示」とされています。

source: Their values always correspond to the most recently started (but not yet stopped) loop of the appropriate type.
ja: これらの値は常に、該当するタイプの最も最近に開始された（しかしまだ停止していない）ループに対応します。

source: Then notepad_pid becomes a placeholder for the actual process ID.
ja: すると、notepad_pidは実際のプロセスIDのプレースホルダーになります。

source: Then try running it again.
ja: その後、もう一度実行してみてください。

source: Then try to fix your code.
ja: それからコードを修正してみてください。

source: Then you would press F2 to activate the selected window, or press Esc to cancel:
ja: そして、選択したウィンドウをアクティブにするにはF2キーを、キャンセルするにはEscキーを押します：

source: Then you would release the left Ctrl to activate the selected window, or press the mouse wheel to cancel.
ja: そして、左Ctrlを離すと選択したウィンドウがアクティブになり、マウスホイールを押すとキャンセルされます。

source: Then, study the code.
ja: それから、コードを研究するのです。

source: There are a few common ways to create a script file:
ja: スクリプト・ファイルを作成する一般的な方法はいくつかあります：

source: There are a few things to know when specifying a window by title:
ja: ウィンドウをタイトルで指定する場合、いくつかの注意点があります：

source: There are a few ways to create an object, and the most common ones are listed below:
ja: オブジェクトを作成する方法はいくつかあるが、最も一般的なものを以下に挙げる：

source: There are a number of reasons you might want to use an object for something.
ja: オブジェクトを何かに使いたい理由はいくつもあるだろう。

source: There are a number of ways to deal with this:
ja: 対処法はいくつもあります：

source: There are also known issues with DirectX.
ja: また、DirectXにも既知の問題がある。

source: There are also user-created solutions such as OnWin.ahk and [How to] Hook on to Shell to receive its messages.
ja: また、OnWin.ahkや [How to] Hook on to Shellなどのユーザーが作成したソリューションがあり、そのメッセージを受信することができます。

source: There are also versions of these functions that do not increment the reference count:
ja: また、これらの関数には、参照カウントをインクリメントしないバージョンもあります：

source: There are also versions of these functions that do not increment the reference count: ObjPtr(obj) and ObjFromPtr(ptr).
ja: また、これらの関数には、参照カウントをインクリメントしないバージョンもあります：ObjPtr(obj)、ObjFromPtr(ptr)。

source: There are apps with which this technique doesn't work.
ja: このテクニックが使えないアプリもある。

source: There are broadly two parts to learning how to send keys:
ja: 鍵の送り方を学ぶには、大きく分けて2つのパートがあります：

source: There are generally two situations where you might need a delay:
ja: ディレイが必要になる場面は、一般的に2つあると思います：

source: There are generally two ways to do this while specifying the precision, and both are shown below:
ja: 精度を指定しながら行う方法は一般的に2つあり、どちらも以下に示すとおりです：

source: There are generally two ways to do this:
ja: 一般的に2つの方法があります：

source: There are instead now separate functions/classes, and no more wildcard names.
ja: その代わり、関数やクラスが別々になり、ワイルドカードの名前もなくなりました。

source: There are many different encodings, but as all of those supported by AutoHotkey include ASCII as a subset, character codes 0 to 127 always have the same meaning.
ja: エンコーディングには様々なものがありますが、AutoHotkeyがサポートするものはすべてASCIIをサブセットとして含んでいるため、文字コード0～127は常に同じ意味を持ちます。

source: There are many variations of this problem, such as:
ja: 以下のように、この問題には様々なバリエーションがあります：

source: There are many ways to use objects, including retrieving values, setting values, adding more values, and more.
ja: 値の取得、値の設定、値の追加など、オブジェクトを使う方法はたくさんある。

source: There are multiple benefits:
ja: メリットは複数あります：

source: There are multiple ways to define a function:
ja: 関数を定義する方法は複数あります：

source: There are no "commands", only function call statements, which are just function or method calls without parentheses.
ja: コマンドは存在せず、ただ 関数呼び出し文があります。これは、括弧のない単なる関数やメソッドの呼び出しです。

source: There are no "default" GUIs, as the target Gui or control object is always specified.
ja: ターゲットとなるGUIやコントロールオブジェクトは常に指定されるため、「デフォルト」のGUIは存在しない。

source: There are no additional parameters.
ja: 追加のパラメータはありません。

source: There are no built-in variables containing information about events.
ja: イベントに関する情報を含む組み込み変数はありません。

source: There are no matching windows.
ja: 条件に一致するウィンドウがありません。

source: There are no more "g-labels" or labels/functions which automatically handle GUI events.
ja: GUIイベントを自動的に処理する「g-labels」やラベル/ファンクションはもう存在しません。

source: There are other symbols used in expressions which don't quite fit into any of the categories defined above, or that affect the meaning of other parts of the expression, as described below.
ja: このほかにも、以下に示すように、上記の分類に当てはまらない、あるいは表現の他の部分の意味に影響を与えるような記号が表現に使用されています。

source: There are several more caveats to the #HotIf directive:
ja: #HotIf指令には、さらにいくつかの注意事項があります：

source: There are several types of loop statements:
ja: ループ文にはいくつかの種類があります：

source: There are several ways of doing this, but the simplest way is InputBox.
ja: これにはいくつかの方法があるが、最も単純な方法はInputBoxである。

source: There are several ways to do this, including:
ja: 以下のように、いくつかの方法があります：

source: There are several ways to make a script (or any program) launch automatically every time you start your PC.
ja: PCを起動するたびにスクリプト（または任意のプログラム）が自動的に起動するようにするには、いくつかの方法があります。

source: There are some differences relating to backward-compatibility:
ja: 後方互換性に関連するいくつかの相違点があります：

source: There are some icons built into the operating system's DLLs and CPLs that might be useful.
ja: オペレーティングシステムのDLLやCPLには、便利なアイコンがいくつか組み込まれている。

source: There are some other advanced features as well, such as command line parameters and CLSID.
ja: コマンドラインパラメーターやCLSIDなど、他にも高度な機能がある。

source: There are three categories:
ja: 3つのカテゴリーがあります：

source: There are three distinct cases, shown as example code below.
ja: 以下のコード例に示すように、3つのケースがある。

source: There are three methods, and they can generally be used in combination:
ja: 3つの方法があり、一般的に組み合わせて使うことができる：

source: There are three methods:
ja: 3つの方式：

source: There are too many other competing timers.
ja: 他に競合するタイマーが多すぎる。

source: There are two fundamental types:
ja: 基本的には2つのタイプがある：

source: There are two general ways to create custom objects:
ja: カスタム・オブジェクトを作成するには、一般的に2つの方法がある：

source: There are two methods of installing v1 and v2 together:
ja: v1とv2を一緒にインストールする方法は2つある：

source: There are two rectangles specified below:
ja: 以下の2つの長方形がある：

source: There are two rectangles specified below: an outer and an inner.
ja: 以下の2つの長方形がある：外側と内側。

source: There are two types of DPI scaling that relate to AutoHotkey:
ja: AutoHotkeyに関連するDPIスケーリングには2種類あります：

source: There are two types of DPI scaling that relate to AutoHotkey: Gui DPI Scaling and OS DPI Scaling.
ja: AutoHotkeyに関連するDPIスケーリングには2種類あります：GUI DPIスケーリングとOS DPIスケーリング。

source: There are two types of methods:
ja: 方法には2種類ある：

source: There are two ways that BoundFunc objects can be created:
ja: BoundFuncオブジェクトを作成する方法は2つある：

source: There are two ways to concatenate values in an expression:
ja: 式中の値を連結する方法は2つあります：

source: There are two ways to do this:
ja: これには2つの方法がある：

source: There are two ways to restore the key's normal function:
ja: キーの正常な機能を回復させるには、2つの方法があります：

source: There are two ways to use +Owner, as shown below:
ja: +Ownerの使い方には、以下の2通りがあります：

source: There are value properties and dynamic properties.
ja: バリュープロパティとダイナミックプロパティがあります。

source: There are various ways to return multiple values from function to caller described within Returning Values to Caller.
ja: 関数から呼び出し元へ複数の値を返す方法は、「呼び出し元への値の返し方」で説明したとおり、さまざまな方法があります。

source: There can be any amount of whitespace or comments between the two.
ja: 2つの間に空白やコメントをいくら入れてもよい。

source: There can be only one last found window at a time, but you can use as many window IDs as you can make up variable names for (or you can use an array).
ja: 最後に見つけたウィンドウは一度に1つだけですが、ウィンドウIDは変数名を作れるだけ使えます（配列を使うこともできます）。

source: There is a more elaborate script to distinguish between single, double, and triple-presses at the bottom of the SetTimer page.
ja: SetTimerページの下部には、単押し、二度押し、三度押しを区別する、より精巧なスクリプトがあります。

source: There is an automatic delay after every click-down and click-up of the mouse (except for SendInput mode and for turning the mouse wheel).
ja: マウスのクリックダウンとクリックアップのたびに、自動的に遅延が発生します（SendInputモードとマウスホイールを回す場合を除く）。

source: There is an automatic delay after every click-down and click-up of the mouse (except for SendInput mode).
ja: マウスのクリックダウンとクリックアップのたびに、自動的に遅延が発生します（SendInputモードは除く）。

source: There is an automatic delay after every movement of the mouse (except for SendInput mode).
ja: マウスを動かすたびに自動で遅延が発生します（SendInputモードは除く）。
